Revit 2027 API
BuiltInFailures.SketchFailures.CurveFromPickedFailed Property
 Can't create boundary from pick.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CurveFromPickedFailed { get; }
Public Shared ReadOnly Property CurveFromPickedFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CurveFromPickedFailed {
	FailureDefinitionId^ get ();
}
static member CurveFromPickedFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace